test/request-response-samples/RequestHeaders__omit_element_when_empty/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ><soap:Body><Request xmlns="http://www.example.com/v1"></Request></soap:Body></soap:Envelope>